Examinator/src/InformationRegisters/ПлеерКурсовВебКабинетаСУЗ/ПлеерКурсовВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлеерКурсовВебКабинетаСУЗ</name>
  <resources>
    <name>Плеер</name>
    <type>
      <types>EnumRef.ПлеерыКурсовВебКабинетаСУЗ</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ПлеерыКурсовВебКабинетаСУЗ/ПлеерыКурсовВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПлеерыКурсовВебКабинетаСУЗ</name>
  <enumValues>
    <name>Автономный</name>
  </enumValues>
  <enumValues>
    <name>Встроенный</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ИнформацияНаФинальнойСтраницеТестаСУЗ/ИнформацияНаФинальнойСтраницеТестаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИнформацияНаФинальнойСтраницеТестаСУЗ</name>
  <enumValues>
    <name>ВопросыСОшибками</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыВопросовСУЗ/ТипыВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВопросовСУЗ</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногихПсихологический</name>
  </enumValues>
  <enumValues>
    <name>МногиеИзМногихПсихологический</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СодержаниеСУЗ/СодержаниеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьСсылкиНаТерминыГлоссария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьПользовательскиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ФайлыСУЗ/ФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайловСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументовСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ПлеерКурсовВебКабинетаСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ВстроенныйПлеерИспользуетсяВЭлектронныхРесурсах() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПлеерКурсовВебКабинетаСУЗ.ЭлектронныйРесурс КАК ЭлектронныйРесурс
		|ИЗ
		|	РегистрСведений.ПлеерКурсовВебКабинетаСУЗ КАК ПлеерКурсовВебКабинетаСУЗ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция Плеер(Знач ЭлектронныйРесурс) Экспорт
	
	Если ИспользоватьВстроенныйПлеер(ЭлектронныйРесурс) Тогда
		Возврат Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный;
	Иначе
		Возврат Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Автономный;
	КонецЕсли;
	
КонецФункции

Функция ИспользоватьВстроенныйПлеер(Знач ЭлектронныйРесурс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ РазработкаСУЗ.ИспользоватьВстроенныйПлеерКурсовВебКабинета() Тогда
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлеерКурсовВебКабинетаСУЗ.ЭлектронныйРесурс КАК ЭлектронныйРесурс
		|ИЗ
		|	РегистрСведений.ПлеерКурсовВебКабинетаСУЗ КАК ПлеерКурсовВебКабинетаСУЗ
		|ГДЕ
		|	ПлеерКурсовВебКабинетаСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс";
	
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Процедура УстановитьИспользованиеВстроенногоПлеера(Знач ЭлектронныйРесурс, ВыполнитьПроверку = Ложь) Экспорт
	
	Если ВыполнитьПроверку Тогда
		СформироватьСтруктуруЭлектронногоКурса(ЭлектронныйРесурс); // Будет исключение в случае проблем
	КонецЕсли;
	
	ДобавитьНовуюЗапись(ЭлектронныйРесурс);
	
КонецПроцедуры

Процедура ОтменитьИспользованиеВстроенногоПлеера(Знач ЭлектронныйРесурс, Успех, ПроведенияОбученияСоВстроеннымПлеером) Экспорт
	
	Если НЕ ИспользоватьВстроенныйПлеер(ЭлектронныйРесурс) Тогда
		Возврат;
	КонецЕсли;
	
	ПроведенияОбученияСоВстроеннымПлеером = Документы.ПроведениеОбученияСУО.ПроведенияОбученияСоВстроеннымПлеером(ЭлектронныйРесурс);
	
	Если ПроведенияОбученияСоВстроеннымПлеером.Количество() = 0 Тогда		
		УдалитьЗапись(ЭлектронныйРесурс);
		Успех = Истина;
	Иначе
		Успех = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСведенияЭлектронногоРесурса(Знач ЭлектронныйРесурс) Экспорт
	
	Если НЕ ИспользоватьВстроенныйПлеер(ЭлектронныйРесурс) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьНовуюЗапись(ЭлектронныйРесурс);
		
КонецПроцедуры

Функция ВыгрузитьДанныеДляВебКабинета(Знач ЭлектронныйРесурс, Знач КонтрольнаяСумма, Знач РезультатИнициализацииКаталога, Знач РазмещениеКнопкиВыхода) Экспорт
	
	Если НЕ РазработкаСУЗ.ИспользоватьВстроенныйПлеерКурсовВебКабинета() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ИспользоватьВстроенныйПлеер(ЭлектронныйРесурс) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ РезультатИнициализацииКаталога.КаталогИнициализирован Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураКурса = СформироватьСтруктуруЭлектронногоКурса(ЭлектронныйРесурс);
	
	Если СтруктураКурса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураКурса.checkSum = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(КонтрольнаяСумма);
	СтруктураКурса.closeButtonPosition = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.ЗначениеВСтроку(РазмещениеКнопкиВыхода);
	 
	ТекстФайлаДанныхДляВебКабинета = "var courseData = " + ЭлектронноеОбучениеСлужебный.ДанныеВJSON(СтруктураКурса) + ";";
	
	ПутьКФайлуДанныхДляВебКабинета = РезультатИнициализацииКаталога.ПутьККаталогуПубликации + "cabinet.js";
	ТекстовыйДокументДанныхДляВебКабинета = Новый ТекстовыйДокумент; 
	ТекстовыйДокументДанныхДляВебКабинета.УстановитьТекст(ТекстФайлаДанныхДляВебКабинета);
	ТекстовыйДокументДанныхДляВебКабинета.Записать(ПутьКФайлуДанныхДляВебКабинета);
	
	Возврат Истина;
	
КонецФункции

// Вспомогательные функции

Процедура ДобавитьНовуюЗапись(Знач ЭлектронныйРесурс)
		
	НаборЗаписей = РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(ЭлектронныйРесурс);
				
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ЭлектронныйРесурс = ЭлектронныйРесурс;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();
	НоваяЗапись.Плеер = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный;

	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьЗапись(Знач ЭлектронныйРесурс)
		
	НаборЗаписей = РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(ЭлектронныйРесурс);

	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция СформироватьСтруктуруЭлектронногоКурса(Знач ЭлектронныйРесурс)
	
	// Делаем проверки
	//
		
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		ВызватьИсключение НСтр("ru = 'Электронный курс для публикации не задан'");
	КонецЕсли;	
	
	// Получаем реквизиты курса и его содержание
	//
	
	ТребуемыеДанныеЭК = Новый Структура();
	ТребуемыеДанныеЭК.Вставить("Наименование", "Наименование");
	ТребуемыеДанныеЭК.Вставить("Тип", "Тип");
	ТребуемыеДанныеЭК.Вставить("СтартоваяСтраница", "СтартоваяСтраница");
	ТребуемыеДанныеЭК.Вставить("Глоссарий", "Глоссарий");
		
	ДанныеЭлектронногоКурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйРесурс, ТребуемыеДанныеЭК);	
	
	ПоставщикСводаЗнаний  = Справочники.СводыЗнанийСУЗ.Поставщик(ЭлектронныйРесурс);

	// Получаем структуру курса и список ресурсов для выгрузки
	//
	
	СтруктураКурса = Новый Структура;
	СтруктураКурса.Вставить("title", ДанныеЭлектронногоКурса.Наименование);
	СтруктураКурса.Вставить("uuid", Строка(ЭлектронныйРесурс.УникальныйИдентификатор()));
	СтруктураКурса.Вставить("checkSum", "");
	СтруктураКурса.Вставить("closeButtonPosition", "auto");	
	
	РесурсыКурса = Новый Массив;
	
	ЭлементыПоиска = Неопределено;	
		
	ДанныеПоиска = Новый Структура();
	ДанныеПоиска.Вставить("index", Новый Структура);
	
	ДанныеПоиска.index = Новый Структура;
	ДанныеПоиска.index.Вставить("type", "RAW");
	ДанныеПоиска.index.Вставить("data", Новый Структура);
	
	ДанныеПоиска.index.data = Новый Структура();
	ДанныеПоиска.index.data.Вставить("elements", Новый Массив);
	
	СтруктураКурса.Вставить("search", ДанныеПоиска);
	
	ЭлементыПоиска = ДанныеПоиска.index.data.elements; 
			
	// Добавляем слайды
	//
	
	МассивСлайдов = Новый Массив;
	СтруктураКурса.Вставить("slides", МассивСлайдов);
	
	// Стартовый слайд
	
	Если ЗначениеЗаполнено(ДанныеЭлектронногоКурса.СтартоваяСтраница) Тогда
		
		СтруктураСлайда = Новый Структура;
		СтруктураСлайда.Вставить("uuid", Строка(ЭлектронныйРесурс.УникальныйИдентификатор())+ "-start");
		СтруктураСлайда.Вставить("type", "START");		
		
		ДанныеДокумента = ДанныеТекстовогоСлайда(ДанныеЭлектронногоКурса.СтартоваяСтраница, ПоставщикСводаЗнаний, СтруктураСлайда.uuid, ЭлементыПоиска);
						
		СтруктураСлайда.Вставить("text", ДанныеДокумента);
					
		МассивСлайдов.Добавить(СтруктураСлайда);			
			
	КонецЕсли;
	
	// Глоссарий
	
	Если ЗначениеЗаполнено(ДанныеЭлектронногоКурса.Глоссарий) Тогда
		
		СтруктураКурса.Вставить("glossary", Строка(ДанныеЭлектронногоКурса.Глоссарий.УникальныйИдентификатор()));
		
		СтруктураСлайда = Новый Структура;
		СтруктураСлайда.Вставить("uuid", Строка(ДанныеЭлектронногоКурса.Глоссарий.УникальныйИдентификатор()));
		СтруктураСлайда.Вставить("type", "GLOSSARY");		
		СтруктураСлайда.Вставить("hidden", Истина);
		
		СтруктураГлоссария = ДанныеГлоссария(ДанныеЭлектронногоКурса.Глоссарий);
		
		СтруктураСлайда.Вставить("glossary", СтруктураГлоссария);
							
		МассивСлайдов.Добавить(СтруктураСлайда);			
			
	КонецЕсли;
	
	// Слайды элементов содержания
	
	ТаблицаСлайдов = Новый ТаблицаЗначений;
	ТаблицаСлайдов.Колонки.Добавить("СсылкаНаЭлемент");
	ТаблицаСлайдов.Колонки.Добавить("Скрытый");
	ТаблицаСлайдов.Колонки.Добавить("СсылкаНаЭлементСодержания");
	ТаблицаСлайдов.Колонки.Добавить("ИдентичныйРесурс");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаЭлемент,
		|	СодержаниеСУЗ.Наименование КАК Наименование,
		|	СодержаниеСУЗ.Ссылка КАК Ссылка,
		|	СодержаниеСУЗ.СсылкаНаЭлемент.ИдентичныйРесурс КАК ИдентичныйРесурс
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ";


	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		НоваяСтрока = ТаблицаСлайдов.Добавить();
		НоваяСтрока.СсылкаНаЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаЭлемент;
		НоваяСтрока.СсылкаНаЭлементСодержания = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.ИдентичныйРесурс = ВыборкаДетальныеЗаписи.ИдентичныйРесурс;
		НоваяСтрока.Скрытый = Ложь;		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗСкрытыеРесурсы.Ресурс КАК СсылкаНаЭлемент,
		|	СводыЗнанийСУЗСкрытыеРесурсы.Ресурс.ИдентичныйРесурс КАК ИдентичныйРесурс
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ.СкрытыеРесурсы КАК СводыЗнанийСУЗСкрытыеРесурсы
		|ГДЕ
		|	СводыЗнанийСУЗСкрытыеРесурсы.Ссылка = &ЭлектронныйРесурс";
	
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИдентичныйРесурс)
			И ТаблицаСлайдов.Найти(ВыборкаДетальныеЗаписи.ИдентичныйРесурс, "СсылкаНаЭлемент") <> Неопределено Тогда
			Продолжить; // Слайд уже есть
		КонецЕсли;
		Если ТаблицаСлайдов.Найти(ВыборкаДетальныеЗаписи.СсылкаНаЭлемент, "СсылкаНаЭлемент") <> Неопределено Тогда
			Продолжить; // Слайд уже есть
		КонецЕсли;
		Если ТаблицаСлайдов.Найти(ВыборкаДетальныеЗаписи.СсылкаНаЭлемент, "ИдентичныйРесурс") <> Неопределено Тогда
			Продолжить; // Слайд уже есть
		КонецЕсли;
		НоваяСтрока = ТаблицаСлайдов.Добавить();
		НоваяСтрока.СсылкаНаЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаЭлемент;
		НоваяСтрока.СсылкаНаЭлементСодержания = Неопределено;
		НоваяСтрока.ИдентичныйРесурс = ВыборкаДетальныеЗаписи.ИдентичныйРесурс;
		НоваяСтрока.Скрытый = Истина;
	КонецЦикла;
	
	ТаблицаСлайдов.Колонки.Удалить("ИдентичныйРесурс"); // Не требуется после формирования
	
	Для каждого Строка Из ТаблицаСлайдов Цикл		
		
		ИдентификаторСлайда = Строка(Строка.СсылкаНаЭлемент.УникальныйИдентификатор());
		
		СтруктураСлайда = Новый Структура;
		СтруктураСлайда.Вставить("uuid", ИдентификаторСлайда);		
		СтруктураСлайда.Вставить("hidden", Строка.Скрытый);
		
		Если ТипЗнч(Строка.СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
			
			Подборка = Строка.СсылкаНаЭлемент;		
			ТаблицаГруппПодборки = Справочники.ПодборкиСУЗ.ПолучитьГруппыЭлементовПодборки(Подборка);
			ДанныеПодборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подборка, "ЭтоТест");
			
			Если ДанныеПодборки.ЭтоТест Тогда
				
				ЭлектронныйТест = Строка.СсылкаНаЭлемент;
				
				ДанныеЭлектронногоТеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ЭлектронныйТест,
				"ВыбиратьЭлементыИзРубрикатора,
				|ВремяТеста,
				|КоличествоПопыток,
				|ПеремешиватьГруппыЭлементов,
				|ПереходитьВпередАвтоматически,
				|ПоказыватьНавигацию,
				|КоличествоГруппЭлементов,
				|НазначениеТестирования,
				|ОбщийФинальныйКомментарий,
				|ОбщийФинальныйРесурс,
				|УчитыватьПредыдущиеПопытки,
				|ИсключитьОткрытыеВопросы,
				|ПоказыватьСтоимостьВопроса,
				|СкрытьКомментарииВопросов,
				|ИнформацияНаФинальнойСтранице");
				
				Если ДанныеЭлектронногоТеста.УчитыватьПредыдущиеПопытки Тогда
					ВызватьИсключение НСтр("ru = 'Настройка ""Учитывать предыдущие попытки"" в тесте не поддерживается'")
				КонецЕсли;
				
				СтруктураТеста = Новый Структура;			
				СложностьТеста = Новый Структура;
				СтруктураСлайда.Вставить("quiz", СтруктураТеста);			
				СтруктураСлайда.Вставить("type", "QUIZ");
				
				
				СтруктураТеста.Вставить("uuid", ЭлектронныйТест.УникальныйИдентификатор());			
				СтруктураТеста.Вставить("level", СложностьТеста);
				СтруктураТеста.Вставить("countAttempts", ДанныеЭлектронногоТеста.КоличествоПопыток);
				
				СтруктураТеста.Вставить("displayQuestionResults", НЕ ДанныеЭлектронногоТеста.СкрытьКомментарииВопросов);
				Если ДанныеЭлектронногоТеста.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Упражнение Тогда
					СтруктураТеста.Вставить("allowCorrectMistakes", Истина);
				Иначе
					СтруктураТеста.Вставить("allowCorrectMistakes", Ложь);
				КонецЕсли;
				
				СтруктураТеста.Вставить("randomizeQuestions", ДанныеЭлектронногоТеста.ПеремешиватьГруппыЭлементов);
				Если ДанныеЭлектронногоТеста.ИнформацияНаФинальнойСтранице = Перечисления.ИнформацияНаФинальнойСтраницеТестаСУЗ.ВопросыСОшибками Тогда					
					СтруктураТеста.Вставить("displayFinalStatistic", Истина);
				Иначе
					СтруктураТеста.Вставить("displayFinalStatistic", Ложь);
				КонецЕсли;
				
				Если ДанныеЭлектронногоТеста.НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Упражнение Тогда
					СтруктураТеста.Вставить("displayKeys", Истина);
				Иначе
					СтруктураТеста.Вставить("displayKeys", Ложь);
				КонецЕсли;
				
				СложностьТеста.Вставить("countQuestions", ДанныеЭлектронногоТеста.КоличествоГруппЭлементов);
				
				СложностьТеста.Вставить("timePeriod", ИзучениеЭлектронныхКурсовСлужебныйSCORM.КоличествоСекундИзДаты(ДанныеЭлектронногоТеста.ВремяТеста));
				
				Если ДанныеЭлектронногоТеста.ВыбиратьЭлементыИзРубрикатора Тогда					
					ПараметрыЭкспорта = Новый Структура;
					КонтекстВыполнения = ОбъектыСУЗ.ЗаполнитьКонтекстВыполненияОбъекта(, Строка.СсылкаНаЭлементСодержания,,,,,,,ПараметрыЭкспорта);
					ОписаниеВопросовСтраницы = Справочники.ПодборкиСУЗ.ВопросыИзРубрикатора(ЭлектронныйТест, Ложь, 0, ПараметрыЭкспорта, КонтекстВыполнения);
				Иначе					
					ОписаниеВопросовСтраницы = Справочники.ПодборкиСУЗ.ВсеЭлементы(ЭлектронныйТест,, Тип("СправочникСсылка.ВопросыСУЗ"));
					МассивВопросов = ОписаниеВопросовСтраницы.ВыгрузитьКолонку("СсылкаНаОбъектСУЗ");
				КонецЕсли;
				
				ВопросыТеста = СтруктураТестовыхВопросовДляПросмотра(МассивВопросов, ЭлектронныйРесурс, ПоставщикСводаЗнаний);
				СтруктураТеста.Вставить("questions", ВопросыТеста);
				
			Иначе
				
				СтруктураПодборки = Новый Структура;
				СтруктураПодборки.Вставить("uuid", Подборка.УникальныйИдентификатор());		
				СтруктураПодборки.Вставить("elements", Новый Массив);
				
				СтруктураСлайда.Вставить("type", "COLLECTION");
				СтруктураСлайда.Вставить("collection", СтруктураПодборки);						
				
				ПоказыватьНаименованиеЭлементаПодборки = Истина;
				
				Для каждого СтрокаТГП Из ТаблицаГруппПодборки Цикл
					
					Если СтрокаТГП.ЭтоГруппа Тогда
						
						ЭлементыГруппы = Справочники.ПодборкиСУЗ.ВсеЭлементы(Подборка, СтрокаТГП.Ссылка); 
						
						Для каждого СтрокаТЭП Из ЭлементыГруппы Цикл
							
							СтруктураЭлементаПодборки = ДанныеЭлементаСлайдаКоллекции(
							СтрокаТЭП.Ссылка, СтрокаТЭП.СсылкаНаОбъектСУЗ, ПоставщикСводаЗнаний, СтруктураПодборки.uuid, ПоказыватьНаименованиеЭлементаПодборки, ЭлементыПоиска, Строка.СсылкаНаЭлементСодержания);
							
							СтруктураПодборки.elements.Добавить(СтруктураЭлементаПодборки);
							
						КонецЦикла;
						
					Иначе
						
						СтруктураЭлементаПодборки = ДанныеЭлементаСлайдаКоллекции(
						СтрокаТГП.Ссылка, СтрокаТГП.СсылкаНаОбъектСУЗ, ПоставщикСводаЗнаний, СтруктураПодборки.uuid, ПоказыватьНаименованиеЭлементаПодборки, ЭлементыПоиска, Строка.СсылкаНаЭлементСодержания);
						
						СтруктураПодборки.elements.Добавить(СтруктураЭлементаПодборки);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Строка.СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
			
			ЗаполнитьКонтентСлайда(СтруктураСлайда, Строка.СсылкаНаЭлемент, ЭлементыПоиска, ИдентификаторСлайда, ПоставщикСводаЗнаний, Ложь, Строка.СсылкаНаЭлементСодержания); 	
			
		Иначе
			
			ВызватьИсключение НСтр("ru = 'Курс может содержать только теорию, тесты и ресурсы'");
			
		КонецЕсли;
		
		МассивСлайдов.Добавить(СтруктураСлайда);
		
	КонецЦикла;
	
	// Формируем иерархическое содержание для учебников
	//
	
	Если ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка КАК Ссылка,
			|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаЭлемент,
			|	СодержаниеСУЗ.Наименование,
			|	СодержаниеСУЗ.ЭтоГруппа,
			|	СодержаниеСУЗ.Родитель КАК Группа,
			|	СодержаниеСУЗ.Владелец КАК ЭлектронныйРесурс
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
			|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	СодержаниеСУЗ.Код ИЕРАРХИЯ";

		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

		Результат = Запрос.Выполнить();

		ДеревоСодержанияВыгрузка = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

		ЭлементыДереваСодержания = Новый Массив;		
		ЗаполнитьЭлементыДереваСодержания(ЭлементыДереваСодержания, ДеревоСодержанияВыгрузка.Строки, 1);
		
		ДеревоСодержанияСтруктура = Новый Структура;
		ДеревоСодержанияСтруктура.Вставить("elements", ЭлементыДереваСодержания);
		
		СтруктураКурса.Вставить("toc", ДеревоСодержанияСтруктура);		
		
	КонецЕсли;	
	
	Возврат СтруктураКурса;	
	
КонецФункции

Функция ОтносительныйАдресКаталогаРесурсовКурса()
	Возврат "res";
КонецФункции

Процедура ДобавитьЭлементПоиска(ЭлементыПоиска, ИдентификаторСлайда, Заголовок, ТекстовыеДанные)
	
	Если ЭлементыПоиска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПоиска = Новый Структура;
	ЭлементПоиска.Вставить("slide", ИдентификаторСлайда); 
	ЭлементПоиска.Вставить("title", Заголовок);
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("encoded", Истина);
	ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ТекстовыеДанные));	
	
	ЭлементПоиска.Вставить("text", ДанныеДокумента);
	
	ЭлементыПоиска.Добавить(ЭлементПоиска);
	
КонецПроцедуры

Процедура ЗаполнитьЭлементыДереваСодержания(МассивЭлементов, ТекущиеСтрокиДерева, ТекущийУровеньДерева)
	
	Для каждого Строка Из ТекущиеСтрокиДерева Цикл
	
		ЭлементСтруктура = Новый Структура;
		ЭлементСтруктура.Вставить("title", Строка.Наименование);
		ЭлементСтруктура.Вставить("uuid", Строка(Строка.Ссылка.УникальныйИдентификатор()));
		ЭлементСтруктура.Вставить("hidden", Ложь);
		Если Строка.ЭтоГруппа Тогда
			ЭлементСтруктура.Вставить("slide", "");		
		Иначе
			ЭлементСтруктура.Вставить("slide", Строка(Строка.СсылкаНаЭлемент.УникальныйИдентификатор()));	
		КонецЕсли;
		ЭлементСтруктура.Вставить("isFolder", Строка.ЭтоГруппа);
		
		ЭлементСтруктура.Вставить("elements", Новый Массив);
		
		Если ЗначениеЗаполнено(Строка.Группа) Тогда
			ЭлементСтруктура.Вставить("parent", Строка(Строка.Группа.УникальныйИдентификатор()));
			ЭлементСтруктура.Вставить("opened", ?(ТекущийУровеньДерева > 2, Ложь, Истина));
		Иначе
			ЭлементСтруктура.Вставить("parent", "");
			ЭлементСтруктура.Вставить("opened", Ложь);
		КонецЕсли;
		
		Если Строка.ЭтоГруппа Тогда			
			ЗаполнитьЭлементыДереваСодержания(ЭлементСтруктура.elements, Строка.Строки, ТекущийУровеньДерева + 1); // Рекурсия
		КонецЕсли;			
		
		МассивЭлементов.Добавить(ЭлементСтруктура);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ДанныеТекстовогоСлайда(Знач СсылкаНаЭлемент, Знач ПоставщикСводаЗнаний, Знач ИдентификаторСлайда, ЭлементыПоиска)
	
	Если ТипЗнч(СсылкаНаЭлемент) <> Тип("СправочникСсылка.СтраницыСУЗ") Тогда
		ВызватьИсключение НСтр("ru = 'Неверный тип текстового слайда'");
	КонецЕсли;	
	
	ФорматированныйДокументИзБазы = ОбъектыСУЗ.ПолучитьДанные(СсылкаНаЭлемент, "ТекстСтраницы", Истина, "ФорматированныйДокумент", ПоставщикСводаЗнаний);
	
	ОтносительныйПутьККаталогуРесурсов = ОтносительныйАдресКаталогаРесурсовКурса();
	ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокументИзБазы, СсылкаНаЭлемент.УникальныйИдентификатор(),,,,ОтносительныйПутьККаталогуРесурсов);
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("encoded", Истина);
	ДанныеДокумента.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеФорматированногоДокумента.ПредставлениеHTML));
	
	ДобавитьЭлементПоиска(ЭлементыПоиска, ИдентификаторСлайда, "", ДанныеФорматированногоДокумента.ТекстовыеДанные);
	
	Возврат ДанныеДокумента;	
	
КонецФункции

Функция ДанныеPDFилиHTMLСлайда(ОтносительныйПутьКФайлу)
	
	ОтносительныйПутьККаталогуРесурсов = ОтносительныйАдресКаталогаРесурсовКурса();
	ПутьКФайлу = ОтносительныйПутьККаталогуРесурсов + "/" + ОтносительныйПутьКФайлу;
	ПутьКФайлу = СтрЗаменить(ПутьКФайлу, "\", "/");
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("path", ПутьКФайлу);
	
	Возврат ДанныеДокумента;		
	
КонецФункции

Функция ДанныеВидеоСлайда(ДанныеВидео)
		
	РасширениеИмени = НРег(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеВидео.ИмяФайла));
	
	ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ДанныеВидео.Ссылка, Новый Структура);
	
	Если ДанныеВидео.ВнешнийФайл Тогда
		ПутьКФайлуВидео = ОтносительныйПутьКФайлу;	
	Иначе
		ОтносительныйПутьККаталогуРесурсов = ОтносительныйАдресКаталогаРесурсовКурса();
		ПутьКФайлуВидео = ОтносительныйПутьККаталогуРесурсов + "/" + ОтносительныйПутьКФайлу;
		ПутьКФайлуВидео = СтрЗаменить(ПутьКФайлуВидео, "\", "/");		
	КонецЕсли;
	
	Если РасширениеИмени <> "mp4" Тогда
		ВызватьИсключение НСтр("ru = 'Курс может содержать только видео в формате mp4'");
	КонецЕсли;
	
	ПутьКФайлуМиниатюры = "";
	Если Справочники.ФайлыСУЗ.ЕстьМиниатюра(ДанныеВидео.Ссылка) Тогда
		ПутьКФайлуМиниатюры = Справочники.ФайлыСУЗ.ИмяФайлаМиниатюры(ПутьКФайлуВидео);
	КонецЕсли;
	
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("type", "video/mp4");
	ОписаниеФормата.Вставить("file", ПутьКФайлуВидео);
	
	ДоступныеФорматы = Новый Массив;
	ДоступныеФорматы.Добавить(ОписаниеФормата);
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("autoplay", ДанныеВидео.ПроигрыватьАвтоматически);
	ДанныеДокумента.Вставить("poster", ПутьКФайлуМиниатюры);
	ДанныеДокумента.Вставить("formats", ДоступныеФорматы);
	ДанныеДокумента.Вставить("isExternal", ДанныеВидео.ВнешнийФайл);	
	
	Возврат ДанныеДокумента;		
	
КонецФункции

Функция ДанныеАудиоСлайда(ДанныеАудио)
			
	ФорматАудио = НРег(ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(
		ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеАудио.ИмяФайла)));
		
	ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ДанныеАудио.Ссылка, Новый Структура);
	
	Если ДанныеАудио.ВнешнийФайл Тогда
		ПутьКФайлуАудио = ОтносительныйПутьКФайлу;
	Иначе
		ОтносительныйПутьККаталогуРесурсов = ОтносительныйАдресКаталогаРесурсовКурса();
		ПутьКФайлуАудио = ОтносительныйПутьККаталогуРесурсов + "/" + ОтносительныйПутьКФайлу;
		ПутьКФайлуАудио = СтрЗаменить(ПутьКФайлуАудио, "\", "/");		
	КонецЕсли;
	
	ОписаниеФормата = Новый Структура;
	ОписаниеФормата.Вставить("type", "audio/" + ФорматАудио);
	ОписаниеФормата.Вставить("file", ПутьКФайлуАудио);
	
	ДоступныеФорматы = Новый Массив;
	ДоступныеФорматы.Добавить(ОписаниеФормата);
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("autoplay", ДанныеАудио.ПроигрыватьАвтоматически);
	ДанныеДокумента.Вставить("formats", ДоступныеФорматы);
	ДанныеДокумента.Вставить("isExternal", ДанныеАудио.ВнешнийФайл);	
	
	Возврат ДанныеДокумента;		
	
КонецФункции

Функция ДанныеКартинкиСлайда(ДанныеКартинки)
	
 	ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ДанныеКартинки.Ссылка, Новый Структура);
	ОтносительныйПутьККаталогуРесурсов = ОтносительныйАдресКаталогаРесурсовКурса();
	ПутьКФайлуКартинки = ОтносительныйПутьККаталогуРесурсов + "/" + ОтносительныйПутьКФайлу;
	ПутьКФайлуКартинки = СтрЗаменить(ПутьКФайлуКартинки, "\", "/");
  
    ДанныеКартинки = Новый Структура;
	ДанныеКартинки.Вставить("path", ПутьКФайлуКартинки);
	
	Возврат ДанныеКартинки;
	
КонецФункции

Функция ДанныеГлоссария(СсылкаНаГлоссарий)
		
	СтруктураГлоссария = Новый Структура;
	
	СтруктураГлоссария.Вставить("displayCommand", Истина);
	СтруктураГлоссария.Вставить("doLinks", Истина);
	
	МассивТерминов = Новый Массив;
	
	ВсеТерминыИСинонимы = Справочники.ГлоссарииСУЗ.Термины(СсылкаНаГлоссарий, Истина);
	
	ВсеТермины = ВсеТерминыИСинонимы.НайтиСтроки(Новый Структура("ЭтоСиноним", Ложь));
	
	Для каждого ДанныеТермина Из ВсеТермины Цикл
		
		СтруктураТермина = Новый Структура;
		СтруктураТермина.Вставить("uuid", Строка(ДанныеТермина.Термин.УникальныйИдентификатор()));
		СтруктураТермина.Вставить("title", ДанныеТермина.Наименование);
		СтруктураТермина.Вставить("letter", ДанныеТермина.БукваДляПоиска);
		
		ДанныеОпределения = Новый Структура;
		ДанныеОпределения.Вставить("encoded", Истина);
		ДанныеОпределения.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ДанныеТермина.Определение));
		
		СтруктураТермина.Вставить("description", ДанныеОпределения);
		СтруктураТермина.Вставить("makeLinks", Истина);
		СтруктураТермина.Вставить("numberLinks", 0);
		
		МассивСинонимов = Новый Массив;
		
		ВсеСинонимы = ВсеТерминыИСинонимы.НайтиСтроки(Новый Структура("ЭтоСиноним, Термин", Истина, ДанныеТермина.Термин));
		
		Для каждого ДанныеСинонима Из ВсеСинонимы Цикл
			СтруктураСинонима = Новый Структура;
			СтруктураСинонима.Вставить("title", ДанныеСинонима.Наименование);
			СтруктураСинонима.Вставить("letter", ДанныеСинонима.БукваДляПоиска);				
			МассивСинонимов.Добавить(СтруктураСинонима);
		КонецЦикла;
		
		СтруктураТермина.Вставить("synonyms", МассивСинонимов);
		
		МассивТерминов.Добавить(СтруктураТермина);
		
	КонецЦикла;
	
	СтруктураГлоссария.Вставить("terms", МассивТерминов);	
	
	Возврат СтруктураГлоссария;		
	
КонецФункции

Функция ЗаполнитьКонтентСлайда(СтруктураЭлементаПодборкиИлиСлайда, СсылкаНаЭлемент, ЭлементыПоиска, ИдентификаторСлайда, ПоставщикСводаЗнаний, ЭтоПодборка, ЭлементСодержания)
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.СтраницыСУЗ") Тогда
		
		СтруктураСтраницы = ДанныеТекстовогоСлайда(СсылкаНаЭлемент, ПоставщикСводаЗнаний, ИдентификаторСлайда, ЭлементыПоиска);		
		
		СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "TEXT");
		СтруктураЭлементаПодборкиИлиСлайда.Вставить("text", СтруктураСтраницы);
		
	ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда		
		
		ДанныеРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЭлемент, "ФайлЗапуска, ПараметрыЗапуска, ЕдинственныйФайл, SCO");
		
		Если ДанныеРесурса.SCO Тогда
			
			Если ЭтоПодборка Тогда
				ВызватьИсключение НСтр("ru = 'Размещение объектов SCO внутри теории не поддерживается'");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
				ВызватьИсключение НСтр("ru = 'Не задан элемент содержания при выгрузке объекта SCO'");
			КонецЕсли;
			
			СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "SCO");
			ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ДанныеРесурса.ФайлЗапуска, Новый Структура);
			СтруктураФайла = ДанныеPDFилиHTMLСлайда(ОтносительныйПутьКФайлу);
					
			ТребуемыеДанные = Новый Структура;
			ТребуемыеДанные.Вставить("ПараметрыЗапуска", "ПараметрыЗапуска");
			ТребуемыеДанные.Вставить("КоличествоПопыток", "КоличествоПопыток");
			ТребуемыеДанные.Вставить("ПродолжительностьПопытки", "ПродолжительностьПопытки");
			ТребуемыеДанные.Вставить("ПорогВыполнения", "ПорогВыполнения");
			ТребуемыеДанные.Вставить("ДанныеИнициализации", "ДанныеИнициализации");
			ТребуемыеДанные.Вставить("ДействиеПослеИстеченияВремени", "ДействиеПослеИстеченияВремени");
			
			
			ДанныеЭлементаСодержания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементСодержания, ТребуемыеДанные);
			
			СтруктураSCO = Новый Структура;
			СтруктураSCO.Вставить("path", СтруктураФайла.path);
			СтруктураSCO.Вставить("parameters", ДанныеЭлементаСодержания.ПараметрыЗапуска);
			СтруктураSCO.Вставить("attemptLimit", ДанныеЭлементаСодержания.КоличествоПопыток);
			СтруктураSCO.Вставить("limitConditions", ДанныеЭлементаСодержания.ПродолжительностьПопытки);
			СтруктураSCO.Вставить("completionThreshold", ДанныеЭлементаСодержания.ПорогВыполнения);
			СтруктураSCO.Вставить("dataFromLMS", ДанныеЭлементаСодержания.ДанныеИнициализации);
			СтруктураSCO.Вставить("timeLimitAction", Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.ЗначениеSCORM(ДанныеЭлементаСодержания.ДействиеПослеИстеченияВремени));
			
			СтруктураЭлементаПодборкиИлиСлайда.Вставить("sco", СтруктураSCO);
			
		Иначе
			
			ФайлРесурса = ?(ЗначениеЗаполнено(ДанныеРесурса.ФайлЗапуска), ДанныеРесурса.ФайлЗапуска, ДанныеРесурса.ЕдинственныйФайл);
			
			Если НЕ ЗначениеЗаполнено(ФайлРесурса) Тогда
				ВызватьИсключение НСтр("ru = 'Файл ресурса не задан'");
			КонецЕсли;	
			
			ДанныеФайлаРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФайлРесурса, "Ссылка, ИмяФайла, ТипФайла, ПроигрыватьАвтоматически, ВнешнийФайл");			
			РасширениеИмени = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ДанныеФайлаРесурса.ИмяФайла);
			
			Если ДанныеФайлаРесурса.ТипФайла = Перечисления.ТипыФайловСУЗ.Default
				И РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ЭтоФайлHTML(РасширениеИмени) Тогда
				
				ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ФайлРесурса, Новый Структура);
				СтруктураФайла = ДанныеPDFилиHTMLСлайда(ОтносительныйПутьКФайлу);	
				
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "HTML");
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("html", СтруктураФайла);
				
			ИначеЕсли ДанныеФайлаРесурса.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
				
				ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ФайлРесурса, Новый Структура);
				ПутьКФайлуЗапускаДокумента = РазработкаСУЗКлиентСервер.ПутьКФайлуЗапускаДокумента(ОтносительныйПутьКФайлу);
				СтруктураФайла = ДанныеPDFилиHTMLСлайда(ПутьКФайлуЗапускаДокумента);	
				
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "HTML");
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("html", СтруктураФайла);
				
			ИначеЕсли ДанныеФайлаРесурса.ТипФайла = Перечисления.ТипыФайловСУЗ.Default
				И РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ЭтоФайлPDF(РасширениеИмени) Тогда
				
				ОтносительныйПутьКФайлу = Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ФайлРесурса, Новый Структура);
				СтруктураФайла = ДанныеPDFилиHTMLСлайда(ОтносительныйПутьКФайлу);	
				
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "PDF");
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("pdf", СтруктураФайла);				
				
			ИначеЕсли ДанныеФайлаРесурса.ТипФайла = Перечисления.ТипыФайловСУЗ.Video Тогда
				
				СтруктураФайла = ДанныеВидеоСлайда(ДанныеФайлаРесурса);	
				
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "VIDEO");
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("video", СтруктураФайла);							
				
			ИначеЕсли ДанныеФайлаРесурса.ТипФайла = Перечисления.ТипыФайловСУЗ.Audio Тогда
				
				СтруктураФайла = ДанныеАудиоСлайда(ДанныеФайлаРесурса);	
				
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "AUDIO");
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("audio", СтруктураФайла);					
				
			ИначеЕсли ДанныеФайлаРесурса.ТипФайла = Перечисления.ТипыФайловСУЗ.Image Тогда
				
				СтруктураФайла = ДанныеКартинкиСлайда(ДанныеФайлаРесурса);	
				
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("type", "IMAGE");
				СтруктураЭлементаПодборкиИлиСлайда.Вставить("image", СтруктураФайла);				
				
			Иначе
				
				ТекстОшибки = НСтр("ru = 'Тип файла ""%1"" не поддерживается'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Строка(ДанныеФайлаРесурса.ТипФайла));
				ВызватьИсключение ТекстОшибки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Включение элемента типа ""%1"" в теорию не поддерживается'"), Строка(ТипЗнч(СсылкаНаЭлемент)));
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;	
	
КонецФункции

Функция ДанныеЭлементаСлайдаКоллекции(Знач СсылкаНаЭлементПодборки, Знач СсылкаНаЭлемент, Знач ПоставщикСводаЗнаний, Знач ИдентификаторСлайда, Знач ПоказыватьНаименованиеЭлементаПодборки, ЭлементыПоиска, ЭлементСодержания)
	
	СтруктураЭлементаПодборки = Новый Структура;
	СтруктураЭлементаПодборки.Вставить("uuid", СсылкаНаЭлементПодборки.УникальныйИдентификатор());
	
	Если ПоказыватьНаименованиеЭлементаПодборки Тогда
		СтруктураЭлементаПодборки.Вставить("title", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлементПодборки, "Наименование"));
	КонецЕсли;
	
	ЗаполнитьКонтентСлайда(СтруктураЭлементаПодборки, СсылкаНаЭлемент, ЭлементыПоиска, ИдентификаторСлайда, ПоставщикСводаЗнаний, Истина, ЭлементСодержания); 
				
	Возврат СтруктураЭлементаПодборки;	
	
КонецФункции

Функция ДанныеВопросаДляПросмотра(Вопрос)
	
	Если ТипЗнч(Вопрос) = Тип("Массив") Тогда
		МассивВопросов = Вопрос;
	Иначе		
		МассивВопросов = Новый Массив;
		МассивВопросов.Добавить(Вопрос);
	КонецЕсли;
	
	// Формируем таблицу вопросов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТестовыеВопросы.ТипВопроса КАК ТипВопроса,
		|	ТестовыеВопросы.Ссылка КАК Ссылка,
		|	ТестовыеВопросы.ЭлементActiveX КАК Картинка,
		|	ТестовыеВопросы.ПредставлениеГрупп КАК НаименованиеКолонкиЭлементов,
		|	ТестовыеВопросы.ПредставлениеВариантовОтветов КАК НаименованиеКолонкиВариантов,
		|	ТестовыеВопросы.ИспользуетсяФорматированныйДокумент КАК ИспользуетсяФорматированныйДокумент,
		|	ТестовыеВопросы.РазрешенРазвернутыйОтвет КАК РазрешенРазвернутыйОтвет
		|ИЗ
		|	Справочник.ВопросыСУЗ КАК ТестовыеВопросы
		|ГДЕ
		|	ТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ТестовыеВопросы.ЭтоГруппа = ЛОЖЬ
		|	И ТестовыеВопросы.Ссылка В(&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВопросов = Запрос.Выполнить().Выгрузить();
	
	// Выбираем варианты ответов	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтветовНаТестовыеВопросы.Верный КАК Верный,
		|	ВариантыОтветовНаТестовыеВопросы.Ссылка КАК Ссылка,
		|	ВариантыОтветовНаТестовыеВопросы.Код КАК Код,
		|	ВариантыОтветовНаТестовыеВопросы.Владелец КАК Вопрос,
		|	ВариантыОтветовНаТестовыеВопросы.Ресурс КАК Картинка
		|ИЗ
		|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаТестовыеВопросы
		|ГДЕ
		|	ВариантыОтветовНаТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыОтветовНаТестовыеВопросы.Владелец В(&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	
	// Завершаем
	
	Возврат Новый Структура("Вопросы, Варианты", ТаблицаВопросов, ТаблицаВариантов);
	
КонецФункции

Функция СтруктураТестовыхВопросовДляПросмотра(МассивВопросов, ЭлектронныйКурс, ПоставщикСводаЗнаний)
	
	ОтносительныйПутьККаталогуРесурсов = ОтносительныйАдресКаталогаРесурсовКурса();
	Вопросы = Новый Массив;
	
	ДанныеВопросов = ДанныеВопросаДляПросмотра(МассивВопросов);
	
	Для каждого СтрокаТВ Из ДанныеВопросов.Вопросы Цикл
		
		// Формируем основные свойства вопроса
		
		МассивПолучаемыхРеквизитов = Новый Массив();
		МассивПолучаемыхРеквизитов.Добавить("ТекстовыеДанные");
		МассивПолучаемыхРеквизитов.Добавить("ФорматированныйДокумент");
		МассивПолучаемыхРеквизитов.Добавить("ВерныйКомментарий");
		МассивПолучаемыхРеквизитов.Добавить("ОшибочныйКомментарий");
		ВыборкаВсехДанныхВопроса = ОбъектыСУЗ.ПолучитьДанные(СтрокаТВ.Ссылка,,Истина,МассивПолучаемыхРеквизитов,ПоставщикСводаЗнаний);
		
		ТекстВопроса = "";
		ВыборкаВсехДанныхВопроса.Сбросить();
		Если ВыборкаВсехДанныхВопроса.НайтиСледующий("Вопрос", "КодДанных") Тогда
			
			Если СтрокаТВ.ИспользуетсяФорматированныйДокумент Тогда				
				ФорматированныйДокументИзБазы = ВыборкаВсехДанныхВопроса.ФорматированныйДокумент.Получить();
				ДанныеФорматированногоДокумента = ЭлектронноеОбучениеСлужебный.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ФорматированныйДокументИзБазы, СтрокаТВ.Ссылка.УникальныйИдентификатор(),"Вопрос",,,ОтносительныйПутьККаталогуРесурсов);	
				ТекстВопроса = ДанныеФорматированногоДокумента.ПредставлениеHTML;				
			Иначе				
				ТекстВопроса = ВыборкаВсехДанныхВопроса.ТекстовыеДанные;	
				ТекстВопроса = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстВопроса);				
			КонецЕсли;			
			
		КонецЕсли;
		
		ЗаданиеВопроса = Новый Структура;
		ЗаданиеВопроса.Вставить("encoded", Истина);
		ЗаданиеВопроса.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ТекстВопроса));
		
		ТипВопросаСтрока = Перечисления.ТипыВопросовСУЗ.ТипВопросаПлеераВебКабинетаВСтроку(СтрокаТВ.ТипВопроса);
		
		Если СтрокаТВ.РазрешенРазвернутыйОтвет Тогда
			ВызватьИсключение НСтр("ru = 'Настройка ""Разрешен развернутый ответ"" в вопросе не поддерживается'");
		КонецЕсли;
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("uuid", СтрокаТВ.Ссылка.УникальныйИдентификатор());
		СтруктураВопроса.Вставить("type", ТипВопросаСтрока);
		СтруктураВопроса.Вставить("task", ЗаданиеВопроса);
		
		// Ищем все варианты ответов вопроса
		
		ВариантыОтветовВопроса = ДанныеВопросов.Варианты.НайтиСтроки(Новый Структура("Вопрос", СтрокаТВ.Ссылка));
		
		// Заполняем варианты ответов
		
		МассивВариантовОтветов = Новый Массив;
		
		Для каждого СтрокаТВВ Из ВариантыОтветовВопроса Цикл
			
			ВыборкаВсехДанныхВопроса.Сбросить();
			
			Если ВыборкаВсехДанныхВопроса.НайтиСледующий(СтрокаТВВ.Ссылка, "КодДанных") Тогда
				
				ТекстВарианта = Новый Структура;
				ТекстВарианта.Вставить("encoded", Истина);
				
				ТекстВарианта.Вставить("data", ЭлектронноеОбучениеСлужебный.Base64ИзСтроки(ВыборкаВсехДанныхВопроса.ТекстовыеДанные));
				
				СтруктураВарианта = Новый Структура;
				СтруктураВарианта.Вставить("uuid", СтрокаТВВ.Ссылка.УникальныйИдентификатор());
				СтруктураВарианта.Вставить("text", ТекстВарианта);
				СтруктураВарианта.Вставить("correct", СтрокаТВВ.Верный);
				
				Если ЗначениеЗаполнено(СтрокаТВВ.Картинка) Тогда
					
					ФайлКартинки = Неопределено;
					
					Если ТипЗнч(СтрокаТВВ.Картинка) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
						ФайлКартинки = Справочники.РесурсыСУЗ.ЕдинственныйФайлРесурса(СтрокаТВВ.Картинка);	
					КонецЕсли;
					
					Если ТипЗнч(СтрокаТВВ.Картинка) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
						ФайлКартинки = СтрокаТВВ.Картинка;	
					КонецЕсли;
					
					ДанныеФайлаКартинки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФайлКартинки, "ТипФайла, Ссылка");
					
					Если ДанныеФайлаКартинки.ТипФайла <> Перечисления.ТипыФайловСУЗ.Image Тогда
						ВызватьИсключение НСтр("ru = 'К варианту ответа вопроса может быть прикреплена только картинка'");	
					КонецЕсли;
					
					ОписаниеКартинки = ДанныеКартинкиСлайда(ДанныеФайлаКартинки);
					СтруктураВарианта.Вставить("image", ОписаниеКартинки);									
					
				КонецЕсли;
				
				МассивВариантовОтветов.Добавить(СтруктураВарианта);
				
			Иначе
				
				ВызватьИсключение НСтр("ru = 'Данные варианта ответа не найдены'");
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураВопроса.Вставить("variants", МассивВариантовОтветов);

		Вопросы.Добавить(СтруктураВопроса);
	
	КонецЦикла;
	
	Возврат Вопросы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
